<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Faker\Factory as Faker;

class PrefrencesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $terms = [
            
            'في حال التوصيل للمجمعات السكنية التي تحتاج الى ترخيص للدخول لآ يتحمل الطرف الاول اي مسؤولية عن عدم السماح له بالتوصيل ولا يلتزم باي مواقيت معمول بها بالمجمع السكني ويلتزم الطرف الثاني باستخراج التراخيص اللازمة والاتفاق مع الجهة المسؤولة',
            'الطرف الثاني لآ يحق له مطالبة الطرف الاول بتفكيك الاثاث القديم او نقله لذلك يرجى التأكد من خلو المكان المراد وضع الاثاث به من الاثاث القديم وتنظيفه قبل وصول العمال',
            'في حال عدم توفر مصعد خدمات في البنايات السكنية يمكن الطرف الاول من توصيل الاغراض يحق له المطالبة برسوم اضافية للتوصيل الى محل السكن',
            'يتم تأجيل توصيل الطلبيات في الحالات التالية: المطر والكوارث الطبيعية وايام الاحتفالات الوطنية وانقطاع الطرق الناتج عنها. لآ يتم احتساب ايام العطل والاعياد ضمن مدة الانجاز',
            'في حال امتناع او عدم تمكن الطرف الثاني من استلام التوريدات تحت اي ضرف كان عند موعد التسليم يتم احتساب رسوم التخزين 100 درهم اماراتي عن کل يوم تأخير',
            'الطرف الاول غير مسؤول عن اي ضرر في البضاعة غير عيوب التصنيع بعد معاينتها أتناء التسليم',
            'في حال وجود عيب في التصنيع يجب ان تكون جميع البضائع المرتجعة في حالتها الاصلية وغير مستخدمة ولم يحدث لها اي ضرر وسيحتفظ الطرف الاول بالحق في فحص البضاعة قبل قبول ارجاعه',
            'في حال الارجاع وعندما يتعين على فريق التسليم العودة لأخد القطع المراد ارجاعها يتكبد الطرف الثاني رسوم التوصيل والتي سيتم ابلاغه بها قبل وصول الفريق لأخد القطع وسيتم خصم هذه الرسوم من المبلغ المراد استرداده',
            'لا يقبل اي طلب للإرجاع بالنسبة للإسفنج والمراتب والاقمشة والقطع التي تم تفصيلها على الطلب',
            'لا يمكن طلب اعادة جدولة التوصيل والتركيب الا باتصال مسبق خلال 48 ساعة قبل موعد التسليم وسيحدد الموعد الجديد حسب المواعيد المتاحة',
            'الجزء المدفوع كعربون لا يسترد في اي حال من الأحوال وإذا طلب الطرف الثاني الغاء الطلبية يحق للطرف الاول المطالبة بتعويض عن الضرر الناجم عن ذلك',
            'في حال رجوع أي من الشيكات المستلمة بخصوص الدفعات ولاي سبب كان يتم دفع غرامة مالية وقدرها 500 درهم',
            'في حال طلب الطرف الثاني الغاء الطلبية او رفض استلام الطلبية في الموعد المحدد يحق للطرف الأول المطالبة بقيمة العقد كاملة',
            'تبقى ملكية الأغراض للطرف الاول حتى يتم تسديد المبالغ المستحقة بموجب هذا العقد. وفي حال عدم دفع أي دفعة يحق للطرف الأول استرداد الأغراض واتخاد الإجراءات القانونية اللازمة',
            'في حال المنازعات القضائية يتحمل الطرف الثاني جميع الرسوم واتعاب المحاماة الخاصة بالقضية',
            'في حال رغبة الطرف الثاني في إلغاء الطلب بعد مرور يومين على الطلب يحق للطرف الأول المطالبة بمبلغ تعويض عن الاضرار الناجمة عن دالك',
            'لا يحق للطرف الثاني مطالبة الطرف الأول باي تعديلات او إصلاحات في القطع بعد استلامها واذا لزم ذلك يحق للطرف الأول المطالبة برسوم إضافية لذلك',
            'في حال طلب الزبون تغييرات في المواصفات غير المتفق عليه في العقد يحق للطرف الأول المطالبة برسوم إضافية حسب ما سيتم الاتفاق عليه كملحق للعقد',
            'في حال التوصيل وعدم تمكن الطرف الثاني من استلام الطلب او عدم تواجده بمكان التوصيل او لاي سبب كان يتم ارجاع الطلبية وجدولة موعد اخر للتسليم حسب المواعيد المتاحة ويتحمل الطرف الثاني رسوم التوصيل والتركيب وسيتم احتساب المبلغ حسب مكان التوصيل'
        ];

        foreach ($terms as $term) {
            DB::table('prefrences')->insert([
                'terms' => $term,
            ]);
        }
    }
}
